Repository: SuperTurboGrinder/NtwkMonitorV2
Catalog: NativeClient/NativeClient.WebUI/src/i18n/messages.*.xlf
Languages: ru_ru

# editButtonLabel
source: Edit
ru_ru: Изменить

# selectButtonLabel
source: Select
ru_ru: Выбрать

# addNewButtonLabel
source: Add new
ru_ru: Добавить

# refreshButton
source: Refresh
ru_ru: Обновить

# executableServicesColonLabel
source: Executable services:
ru_ru: Выполняемые сервисы:

# webServicesColonLabel
source: Web services:
ru_ru: Веб-сервисы:

# noneLabel
source: None
ru_ru: Нет

source: Tags:
ru_ru: Теги:

source: Created successfully.
ru_ru: Создание успешно.

# UpdatedSuccessfully
source: Saved changes successfully.
ru_ru: Изменения сохранены успешно.

source: Deleted successfully.
ru_ru: Удаление успешно.

# NoChangesDetected
source: No changes detected to save.
ru_ru: Не обнаруженно изменений для сохранения.

# NodeMovedSuccessfully
source: Node successfully moved to new parent.
ru_ru: Узел успешно перемещён.

# SetTagsSuccessfully
source: Successfully binded selected tags to node.
ru_ru: Выбранные тэги успешно привязанны к узлу.

# DatabaseInternalError
source: Database error occured. Report this error please.
ru_ru: Ошибка базы данных.

# ErrorWhileCheckingIDInDatabase
source: Database error occured while checking ID value. Report this error please.
ru_ru: Ошибка базы данных во время проверки ID.

source: Invalid Profile ID.
ru_ru: Неверный ID профиля.

source: Invalid Tag ID.
ru_ru: Неверный ID тега.

source: Invalid Node ID
ru_ru: Неверный ID узла.

source: Invalid Session ID.
ru_ru: Неверный ID сессии.

# InvalidTagsIDs
source: Invalid IDs in Tags IDs list.
ru_ru: Неверный ID в списке тегов.

# ErrorWhileCheckingNameExistanceInDatabase
source: Database error occured while checking name value. Report this error please.
ru_ru: Ошибка базы данных во время проверки имени.

# NameAlreadyClaimed
source: Object name already claimed by another in database.
ru_ru: Имя объекта занято другим объектом в базе данных.

# ErrorWhileGetingExistanceOfWSBindingFromDatabase
source: Database error occured while checking web service binding existance. Report this error please.
ru_ru: Ошибка базы данных во время проверки существования привязки веб сервиса.

# BindingBetweenSpecifiedServiceAndNodeAlreadyExists
source: Can not create web service binding: binding between specified node and service already exists.
ru_ru: Невозмножно привязать веб сервис: этот сервис уже привязан к указанному узлу.

# ErrorWhileCheckingCWSParamNumberInDatabase
source: Database error occured while checking web service parameters number.
ru_ru: Ошибка базы данных во время проверки количества параметров веб сервиса.

source: Invalid Web Service ID.
ru_ru: Неверный ID веб сервиса.

# ServiceBindingSetParementersValueCanNotBeNull
source: Web service parameters values can not be null.
ru_ru: Параметры переданные веб сервису не могут быть null.

# RedundantParameterValuesInServiceBinding
source: Redundant parameter values in service binding data.
ru_ru: Лишние параметры переданы при привязке веб сервиса.

# ErrorWhileCheckingIfNodeIsPartOfSubtree
source: Database error occured while checking if node is part of subtree.
ru_ru: Ошибка базы данных при проверке является ли узел частью поддерева.

# NodeIsPartOfSpecifiedSubtree
source: Can not move subtree to subroot from the same subtree.
ru_ru: Невозможно переместить поддерево на узел находящийся в этом поддереве.

source: Binding between specified service and node does not exist.
ru_ru: Указанный сервис не привязан к указанному узлу.

# InvalidName
source: Invalid name format.
ru_ru: Неверный формат имени.

# InvalidCWSParam1Name
source: Invalid web service parameter 1 name format.
ru_ru: Неверный формат имени первого параметра веб сервиса.

# InvalidCWSParam2Name
source: Invalid web service parameter 2 name format.
ru_ru: Неверный формат имени второго параметра веб сервиса.

# InvalidCWSParam3Name
source: Invalid web service parameter 3 name format.
ru_ru: Неверный формат имени третьего параметра веб сервиса.

# CWSParameterNamesAreNotInOrder
source: Web service parameters names are not filled in correct order.
ru_ru: Имена параметров веб сервиса заполнены не по порядку.

source: Invalid web service string format.
ru_ru: Неверный формат выполняемой строки веб сервиса.

# IpAddressStringIsNull
source: Ip address string can not be null.
ru_ru: Строка ip адреса не может быть null.

source: Ip address string format is invalid.
ru_ru: Неверный формат ip адреса.

source: Invalid monitoring message type value.
ru_ru: Неверный формат сообщения монитора.

# NoSpecifiedExecServiceFoundInBinDirectory
source: No executable service found for this operation in backend server bin directory.
ru_ru: В папке bin не обнаружено подходящего выполняемого файла для заданной операции.

# TooManyCandidatesForSpecefiedExecServiceInBinDirectory
source: Too many candidates for executable service in backend server bin directory.
ru_ru: В папке bin слишком много кандидатов для заданного выполняемого сервиса.

# NotEnoughOSRightsToSearchForExecServices
source: Not enough rights from OS to search for executable services.
ru_ru: Недостаточно прав для запуска выполняемого сервиса.

# CouldNotFindBinDirectoryWhileSearchingForExecutableServices
source: Could not find bin directory in backend server directory.
ru_ru: Не обнаружена папка bin в папке сервера.

# UnknownIOErrorWhileTryingToFindExecutableServices
source: Unknown backend I/O error while searching for executable service.
ru_ru: Неизвестная ошибка ввода/вывода при попытке поиска выполняемого сервиса.

source: Executable service start error.
ru_ru: Ошибка запуска выполняемого сервиса.

# PingExecutionServiceError
source: Ping service sending error.
ru_ru: Ошибка при отправке пинга.

# CustomWebServiceStartError
source: Error while trying to start custom web service.
ru_ru: Ошибка при попытке запуска веб сервиса.

# BadRequestErrorMessageCaption
source: Backend operation error:
ru_ru: Ошибка операции сервера:

# nameLabel
source: Name
ru_ru: Имя

# executablesLabel
source: Executables
ru_ru: Программы

# webServicesLabel
source: Web services
ru_ru: Веб сервисы

# pingLabel
source: Ping
ru_ru: Пинг

# noNodesFoundLabel
source: No nodes found in database.
ru_ru: В базе данных не обнаружено сохранённых узлов.

source: All at once
ru_ru: Весь список одновременно

# showTreeLevelsSpaceLabel
source: Show tree levels
ru_ru: Показанные уровни дерева

# settingsProfileLabel
source: settings profile
ru_ru: профиль настроек

# nameRequiredMessage
source: Name value required.
ru_ru: Необходимо указать имя.

# autoStartMonitoringLabel
source: Auto start monitoring
ru_ru: Автоматически начинать мониторинг при запуске

# spaceDoNotPingChildrenOfUreachableNodesLabel
source: Do not ping children of unreachable nodes
ru_ru: Не отправлять пинг к узлам подключенным к недоступным узлам

# spaceRealTimePingUIUpdateLabel
source: Real time ping UI update
ru_ru: Обновление интерфейса пинга в реальном времени

# monitoringIntervalLabel
source: Monitor ping every
ru_ru: Обновление монитора каждые

# spaceMinutesLabel
source: minutes
ru_ru: минут

# saveButtonLabel
source: Save
ru_ru: Сохранить

# createButtonLabel
source: Create
ru_ru: Создать

# cancelButtonLabel
source: Cancel
ru_ru: Отмена

# nodeTagLabel
source: node tag
ru_ru: тег узла

# yesButton
source: Yes
ru_ru: Да

# noButton
source: No
ru_ru: Нет

# removeButtonLabel
source: Remove
ru_ru: Удалить

# deleteLabel
source: Delete
ru_ru: Удалить

# discardChangesQuestionLabel
source: Discard changes?
ru_ru: Сбросить изменения?

# saveToDatabaseQuestionLabel
source: Save to database?
ru_ru: Сохранить в базу данных?

# saveChangesToDatabaseQuestionLabel
source: Save changes to database?
ru_ru: Сохранить изменения?

# editorViewEditSpaceHeader
source: Edit
ru_ru: Редактировать

# editorViewCreateSpaceHeader
source: New
ru_ru: Новый

# customWebServiceLabel
source: custom web service
ru_ru: веб сервис

# baseHrefLabel
source: Base href
ru_ru: Шаблон сервиса

# useIPLabel
source: Use IP
ru_ru: Использовать IP

# parametrLabel
source: Parameters
ru_ru: Параметры

# addNewLabel
source: Add new
ru_ru: Добавить

# moveButtonLabel
source: Move
ru_ru: Переместить

# toThisButtonLabel
source: To this
ru_ru: Сюда

# addNewOnRootButtonLabel
source: Add new on root
ru_ru: Добавить в корень

# moveToRooButtonLabel
source: Move to root
ru_ru: Переместить в корень

# moveLabel
source: Move
ru_ru: Переместить

# toLabel
source: to
ru_ru: на

# nodeLabel
source: node
ru_ru: узел

# parentPortLabel
source: Parent port
ru_ru: Порт

# ipRequiredMessge
source: IP value required.
ru_ru: Необходимо указать IP.

# invalidFormatMessge
source: Invalid format.
ru_ru: Неверный формат.

# servicesLabel
source: Services:
ru_ru: Сервисы:

# openPingLabel
source: Open ping
ru_ru: Открытый пинг

# setTagsLable
source: Set
ru_ru: Выбранные

# availableTagsLable
source: Available
ru_ru: Доступные

# applyButtonLable
source: Apply
ru_ru: Применить

# noNodeSelectedLabel
source: No node selected
ru_ru: Узел не выбран

# returnButtonLabel
source: Return
ru_ru: Вернуться

# availableLable
source: Available
ru_ru: Доступные

# boundLable
source: Bound
ru_ru: Привязанные

# webServiceBindingLabel
source: web service binding
ru_ru: привязку веб сервиса

# valueRequiredMessge
source: Value required.
ru_ru: Необходимо значение.

# valueRequiredMessage
source: Value required.
ru_ru: Необходимо значение.

# bindButtonLabel
source: Bind
ru_ru: Привязать

source: --Network Monitor V2--
ru_ru: --Монитор Сети V2--

# nodesEditorButtonLabel
source: Nodes
ru_ru: Узлы

# customWebServicesEditorButtonLabel
source: Custom web services
ru_ru: Веб сервисы

# changeSettingsProfileEditorButtonLabel
source: Change settings profile
ru_ru: Сменить профиль настроек

# settingsProfilesEditorButtonLabel
source: Settings profiles
ru_ru: Профили настроек

# tagsEditorButtonLabel
source: Tags
ru_ru: Теги

# webServiceBindingEditorButtonLabel
source: Web service binding
ru_ru: Привязка веб сервисов

# tagBindingEditorButtonLabel
source: Tag binding
ru_ru: Привязка тегов

source: Nodes tag filter
ru_ru: Фильтр узлов по тегам

# listViewLabel
source: list view
ru_ru: список

# monitorLabel
source: monitor
ru_ru: монитор

source: switch
ru_ru: переключить

# networkNodesFilteredBySetTagsLabel
source: Network nodes filtered by set tags
ru_ru: Узлы отфильтрованные по заданным тэгам

# monitoringLabel
source: Monitoring
ru_ru: Мониторинг

# nodesLabel
source: nodes
ru_ru: узлы

# previousPulseColonSpaceBraceLabel
source: Prev. pulse: (
ru_ru: Пред. пульс: (

# closebraceSemicolonSpaceNextColonLabel
source: ); next:
ru_ru: ); след.:

# endCurrentMonitorSessionQuestionLabel
source: End current monitor session?
ru_ru: Завершить текущую сессию мониторинга?

# currentMonitorSessionLabel
source: Current monitor session
ru_ru: Текущая сессия мониторинга

source: to
ru_ru: до

# selectedNodesSpaceLabel
source: Selected nodes
ru_ru: Выбрано узлов

# pulseSpaceLabel
source: Pulse
ru_ru: Пульс

# pingСolonSpaceLabel
source: Ping:
ru_ru: Пинг:

# spaceBraceFailedColonSpaceLabel
source: (Failed:
ru_ru: (Неудач:

# spaceSkippedСolonSpaceLabel
source: Skipped:
ru_ru: Пропущенно:

source: Can not edit while monitor is active
ru_ru: Редактирование не возможно пока запущен монитор

# monitoringSessionHistoryLabel
source: Monitoring sessions history
ru_ru: История сессий монитора

# selectedMonitoringLabel
source: Selected monitoring session
ru_ru: Выбранная сессия монитора
